Documents/ОбращениеВСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОбращениеВСтационар</Name>
			<BasedOn>
				<xr:Item>Document.Прием</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
				<xr:Item>Document.Заявка</xr:Item>
				<xr:Item>Document.ОказаниеУслуг</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛечащийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившееУчреждение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиагнозПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьДоставленСкоройПомощью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставленПоЭкстреннымПоказателям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧерезЧасовПослеНачалаЗаболевания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаГоспитализации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщитьРодственникам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказВГоспитализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказаВГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.удалитьПричиныОтказаВГоспитализации</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйПовторныйОтказ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтказаВГоспитализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяОтказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятыеМеры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рекомендации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачиНаправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналГоспитализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыГоспитализации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНаряда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлкогольноеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаркотическоеОпьянение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяГоспитализации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникЗафиксировавшийОтказ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеДатаВремяВзятияПробы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпьянениеРезультатВзятияПробы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремяИнформированияЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторноеПоступление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационараНаправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыМедицинскихКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Амбулаторная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стоматологическая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стационар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГинекологическаяБеременной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>омг_СтационарРК</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОбращениеВСтационар/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура омг_ЗаполнитьДанныеПоМедицинскойКарте()
	Запрос = Новый Запрос;
	Запрос.Текст = ""; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда
		// Заполнение шапки
		Филиал = ДанныеЗаполнения.Филиал;
		Клиент = ДанныеЗаполнения.Клиент;
		ЛечащийВрач = ДанныеЗаполнения.Врач;
		// Изменено Макеев (
		Если ДанныеЗаполнения.МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар
			Или ДанныеЗаполнения.МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.омг_СтационарРК Тогда
		// )
			МедицинскаяКарта = ДанныеЗаполнения.МедицинскаяКарта;
		КонецЕсли;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		Если ДанныеЗаполнения.Диагнозы.Количество() > 0 Тогда
			ДиагнозНаправления = ДанныеЗаполнения.Диагнозы[0].Диагноз;
		КонецЕсли; 
		
	// Добавлено Макеев (
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Филиал = ДанныеЗаполнения.Филиал;
		Клиент = ДанныеЗаполнения.Клиент;
		ЛечащийВрач = ДанныеЗаполнения.Сотрудник;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Прием.МедицинскаяКарта КАК МедицинскаяКарта,
		               |	Прием.Ссылка КАК Ссылка,
		               |	Прием.Дата КАК Дата,
		               |	ПриемДиагнозы.Диагноз КАК Диагноз,
		               |	ПриемДиагнозы.НомерСтроки КАК НомерСтроки,
		               |	Прием.Врач.Подразделение КАК Подразделение
		               |ИЗ
		               |	Документ.Прием КАК Прием
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Диагнозы КАК ПриемДиагнозы
		               |		ПО (ПриемДиагнозы.Ссылка = Прием.Ссылка)
		               |ГДЕ
		               |	Прием.ДокументОснование = &ДокументОснование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ,
		               |	НомерСтроки УБЫВ";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаПриема = РезультатЗапроса.Выбрать();
			ВыборкаПриема.Следующий();
			МедицинскаяКарта = ВыборкаПриема.МедицинскаяКарта;
			ДиагнозНаправления = ВыборкаПриема.Диагноз;
			ДокументОснование = ВыборкаПриема.Ссылка; 
			Подразделение = ВыборкаПриема.Подразделение;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		// Заполнение шапки
		Филиал = ДанныеЗаполнения.Филиал;
		Клиент = ДанныеЗаполнения.Клиент;
		ЛечащийВрач = ДанныеЗаполнения.Сотрудник;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Прием.МедицинскаяКарта КАК МедицинскаяКарта,
		               |	Прием.Ссылка КАК Ссылка,
		               |	Прием.Дата КАК Дата,
		               |	ПриемДиагнозы.Диагноз КАК Диагноз,
		               |	ПриемДиагнозы.НомерСтроки КАК НомерСтроки,
		               |	Прием.Врач.Подразделение КАК Подразделение
		               |ИЗ
		               |	Документ.Прием КАК Прием
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Диагнозы КАК ПриемДиагнозы
		               |		ПО (ПриемДиагнозы.Ссылка = Прием.Ссылка)
		               |ГДЕ
		               |	Прием.ДокументОснование = &ДокументОснование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ,
		               |	НомерСтроки УБЫВ";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.ДокументОснование);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаПриема = РезультатЗапроса.Выбрать();
			ВыборкаПриема.Следующий();
			МедицинскаяКарта = ВыборкаПриема.МедицинскаяКарта;
			ДиагнозНаправления = ВыборкаПриема.Диагноз;
			ДокументОснование = ВыборкаПриема.Ссылка;
			Подразделение = ВыборкаПриема.Подразделение;
		КонецЕсли;
	// )
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда	
		
		Клиент = ДанныеЗаполнения.Клиент;
		Подразделение = ДанныеЗаполнения.Палата.Подразделение;
		ДатаВремяПоступления = ДанныеЗаполнения.ДатаНачала;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.ДокументОснование,,"Дата, Номер, ПометкаУдаления, Проведен, Ссылка");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЗначениеЗаполнено(ОбъектКопирования.ПричинаОтказаВГоспитализации) 
		И ТипЗнч(ОбъектКопирования.ПричинаОтказаВГоспитализации) = Тип("СправочникСсылка.удалитьПричиныОтказаВГоспитализации")
		И ЗначениеЗаполнено(ОбъектКопирования.ПричинаОтказаВГоспитализации.УИДЕГИСЗ)
	Тогда
		ПричинаОтказаВГоспитализации = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(ОбъектКопирования.ПричинаОтказаВГоспитализации.УИДЕГИСЗ, Перечисления.ВидыКлассификаторовМинЗдрава.ПричиныОтказовВГоспитализации)
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаУникальностиОбращенияПоМедкарте(Отказ);
	
	Если Не Отказ Тогда
		// Очистка полей госпитализации при отказе в госпитализации и причины отказа при госпитализации.
		Если ОтказВГоспитализации Тогда
			ЛечащийВрач = Неопределено;
			ДатаВремяГоспитализации = Неопределено;
			Подразделение = Неопределено;
		Иначе
			ПричинаОтказаВГоспитализации = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПометкаУдаления Тогда
		Если ОтказВГоспитализации Тогда
			ПроверяемыеРеквизиты.Добавить("ПричинаОтказаВГоспитализации");
			ПроверяемыеРеквизиты.Добавить("ДатаВремяОтказа");
			ПроверяемыеРеквизиты.Добавить("Клиент");
			
		Иначе
			ПроверяемыеРеквизиты.Добавить("МедицинскаяКарта");
			
			Если ЗначениеЗаполнено(ДатаВремяГоспитализации) Тогда
				ПроверяемыеРеквизиты.Добавить("Подразделение");
			ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
				ПроверяемыеРеквизиты.Добавить("ДатаВремяГоспитализации");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаУникальностиОбращенияПоМедкарте(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка, что по этой медкарте еще нет документа обращения в стационар
	Если ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		Обращение = Стационар.ОбращениеПоМедкарте(МедицинскаяКарта, ?(Ссылка.Пустая(), Неопределено, Ссылка));
		Если ЗначениеЗаполнено(Обращение)
			И Обращение <> Ссылка
		Тогда
			Отказ = Истина;
			СообщениеПользователю = СтрШаблон("По данной медкарте уже оформлено обращение: %1", Строка(Обращение));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
